# p1-快速排序-9/23/25---------------------------------------------
# 给定长度为n的整数数列，使用快速排序算法从小到大排序
# 另外需要注意的点是，题中已给输入栏为栏位，应对应着写input
# 方法一：暴力写法，时间复杂度不符合要求------------------------------
n = 5
q = list(map(int,input("比如输入3 1 2 4 5\n").split()))
# 或者这样li = [int(x) for x in input().split()]
for i in range(0, n-1):              # 选取非最后一个数
    for j in range(i+1, n):          # 把它与后边其他比大小
        if q[i] > q[j]:              # 若比后边大则交换
            q[i], q[j] = q[j], q[i]
for i in q:
    print(i, end="")
# 因此应少用迭代(n=10e5)
"""
分治思想
选取某一数值作为分界点，使其左右分别小于和大于它
接着左右小区间继续递归，最后拼接一起
"""
