# p2-简单模拟-9/29/25---------------------------------------------
"""
第一部分:电梯上下楼总时间
    电梯上升一层消耗6秒,下降一层消耗4秒,开关门消耗5秒,下一命乘客消耗1秒
假设有四楼,现有四个人分别要去2 4 3 2层,问送完所有人后回到一楼需要时间

考虑对人群进行排序?
这里采用模拟算法设计,严格按照题目模拟显示,可以分为三部分:
上下楼总时间:上楼层数 * 6 + 下楼层数 * 4
乘客出电梯总时间:人数 * 1
电梯开关门总时间:电梯开关门总时间(取决于去重后的楼层数) * 5
"""
# 上下楼总时间
floor = 4
listf = [2,4,3,2]
number = len(listf)
time1 = (floor - 1) * (6 + 4)
# 乘客出电梯总时间
hax = floor + 1
listhax = [0] * hax      # 类似于计数排序的建表，统计每层人数
for i in listf:
    listhax[i] += 1
# 返回[0,0,2,1,1]
counts = 0
for j in listhax:
    if j > 0:
        counts += 1
time2 = number * 1
# 电梯开关门时间
time3 = counts * 5
# 总时间
time = time1 + time2 + time3
print(f"总共耗费{time}秒")